[
  {
    "name": "Power snatch-",
    "type": "olympic_weightlifting",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "expert",
    "instructions": "Place your feet at a shoulder width stance with the barbell resting right above the connection between the toes and the rest of the foot. With a palms facing down grip, bend at the knees and keeping the back flat grab the bar using a wider than shoulder width grip. Bring the hips down and make sure that your body drops as if you were going to sit on a chair. This will be your starting position. Start pushing the floor as if it were a moving platform with your feet and simultaneously start lifting the barbell keeping it close to your legs. As the bar reaches the middle of your thighs, push the floor with your legs and lift your body to a complete extension in an explosive motion. Lift your shoulders back in a shrugging movement as you bring the bar up while lifting your elbows out to the side and keeping them above the bar for as long as possible. Now in a very quick but powerful motion, you have to get your body under the barbell when it has reached a high enough point where it can be controlled and drop while locking your arms and holding the barbell overhead as you assume a squat position. Finalize the movement by rising up out of the squat position to finish the lift. At the end of the lift both feet should be on line and the arms fully extended holding the barbell overhead.  Caution: This is a very advanced exercise so be extremely careful with the weight used. Bad form on this exercise can lead to serious injury."
  },
  {
    "name": "Narrow-stance squat",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "expert",
    "instructions": "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it. Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso. Step away from the rack and position your legs using a less-than-shoulder-width narrow stance with the toes slightly pointed out. Feet should be around 3-6 inches apart. Keep your head up at all times (looking down will get you off balance) and maintain a straight back. This will be your starting position. Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up."
  },
  {
    "name": "Barbell forward lunge",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "expert",
    "instructions": "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack just below shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it. Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso. Step away from the rack and step forward with your right leg and squat down through your hips, while keeping the torso upright and maintaining balance. Inhale as you go down. Note: Do not allow your knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint. li> Using mainly the heel of your foot, push up and go back to the starting position as you exhale. Repeat the movement for the recommended amount of repetitions and then perform with the left leg.  Caution: This is a movement that requires a great deal of balance so if you suffer from balance problems you may wish to either avoid it or just use your own bodyweight while holding on to a fixed object. Definitely never perform with a barbell on your back if you suffer from balance issues. Variations: There are several ways to perform the exercise.  One way is to alternate each leg. For instance do one repetition with the right, then the left, then the right and so on. The other way is to do what I call a static lunge where your starting position is with one of your feet already forward. In this case, you just go up and down from that starting position until you are done with the recommended amount of repetitions. Then you switch legs and do the same. A more challenging version is the walking lunges where you walk across the room but in a lunging fashion. For walking lunges the leg being left back has to be brought forward after the lunging action has happened in order to continue moving ahead. This version is reserved for the most advanced athletes."
  },
  {
    "name": "Scissors Jump",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "body_only",
    "difficulty": "expert",
    "instructions": "Assume a lunge stance position with one foot forward with the knee bent, and the rear knee nearly touching the ground. Ensure that the front knee is over the midline of the foot. Extending through both legs, jump as high as possible, swinging your arms to gain lift. As you jump as high as you can, switch the position of your legs, moving your front leg to the back and the rear leg to the front. As you land, absorb the impact through the legs by adopting the lunge position, and repeat."
  },
  {
    "name": "Barbell hack squat",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "expert",
    "instructions": "Stand up straight while holding a barbell behind you at arms length and your feet at shoulder width. Tip: A shoulder width grip is best with the palms of your hands facing back. You can use wrist wraps for this exercise for a better grip. This will be your starting position. While keeping your head and eyes up and back straight, squat until your upper thighs are parallel to the floor. Breathe in as you slowly go down. Pressing mainly with the heel of the foot and squeezing the thighs, go back up as you breathe out. Repeat for the recommended amount of repetitions.  Variations: This exercise can also be performed with your heels slightly elevated on a small block. This is a good option for beginners who lack the flexibility to perform the exercise without it."
  },
  {
    "name": "Overhead squat",
    "type": "olympic_weightlifting",
    "muscle": "quadriceps",
    "equipment": "None",
    "difficulty": "expert",
    "instructions": "Start out by having a barbell in front of you on the floor. Your feet should be wider than shoulder width apart from each other. Bend the knees and use a pronated grip (palms facing you) to grab the barbell. Your hands should be at a wider than shoulder width apart from each other before lifting. Once you are positioned, lift the barbell up until you can rest it on your chest. Move the barbell over and slightly behind your head and make sure your arms are fully extended. Keep your head up at all times and also maintain a straight back. Retract your shoulder blades. This is your starting position. Slowly lower the weight by bending your knees until your thighs are parallel to the ground while inhaling. Tip: Keep your back straight while performing this exercise to avoid any injuries and your arms should remain extended and over your head at all times. Now use your feet and legs to help bring the weight back up to the starting position while exhaling. Repeat for the recommended amount of repetitions.  Caution: Use a weight that you are comfortable with to develop proper form."
  },
  {
    "name": "Single-arm side deadlift",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "expert",
    "instructions": "Stand to the side of a barbell next to its center. Bend your knees and lower your body until you are able to reach the barbell. Grasp the bar as if you were grabbing a briefcase (palms facing you since the bar is sideways). You may need a wrist wrap if you are using a significant amount of weight. This is your starting position. Use your legs to help lift the barbell up while exhaling. Your arms should extend fully as bring the barbell up until you are in a standing position. Slowly bring the barbell back down while inhaling. Tip: Make sure to bend your knees while lowering the weight to avoid any injury from occurring. Repeat for the recommended amount of repetitions. Switch arms and repeat the movement.  Caution: This is not an exercise that is recommended for people with lower back problems. Also, jerking motions or doing too much weight can injure your back. Variations: The exercise can also be performed with a dumbbell as described above."
  },
  {
    "name": "Single-arm kettlebell overhead squat",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "kettlebells",
    "difficulty": "expert",
    "instructions": "Clean and press a kettlebell with one arm. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so. Press the weight overhead by extending through the elbow.This will be your starting position. Looking straight ahead and keeping a kettlebell locked out above you, flex the knees and hips and lower your torso between your legs, keeping your head and chest up. Pause at the bottom position for a second before rising back to the top, driving through the heels of your feet."
  },
  {
    "name": "Single-Leg Squat With Knee Tap",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "body_only",
    "difficulty": "expert",
    "instructions": ""
  },
  {
    "name": "Squat Isometric Hold",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "body_only",
    "difficulty": "expert",
    "instructions": ""
  },
  {
    "name": "Dumbbell front raise to lateral raise",
    "type": "strength",
    "muscle": "shoulders",
    "equipment": "dumbbell",
    "difficulty": "intermediate",
    "instructions": "In a standing position, hold a pair of dumbbells at your side. This will be your starting position. Keeping your elbows slightly bent, raise the weights directly in front of you to shoulder height, avoiding any swinging or cheating. At the top of the exercise move the weights out in front of you, keeping your arms extended. Lower the weights with a controlled motion. On the next repetition, raise the weights in front of you to shoulder height before moving the weights laterally to your sides. Lower the weights to the starting position."
  },
  {
    "name": "Clean from Blocks",
    "type": "olympic_weightlifting",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "With a barbell on boxes or stands of the desired height, take an overhand or hook grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position. Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight with the elbows pointed out. Next comes the second pull, the main source of acceleration for the clean. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight. At the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended.3.  As full extension is achieved, transition into the receiving position by aggressively shrugging and flexing the arms with the elbows up and out. Aggressively pull yourself down, rotating your elbows under the bar as you do so. Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom squat position, which will help in the recovery. Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position. Return the weight to the boxes for the next rep."
  },
  {
    "name": "Incline Hammer Curls",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Seat yourself on an incline bench with a dumbbell in each hand. You should pressed firmly against he back with your feet together. Allow the dumbbells to hang straight down at your side, holding them with a neutral grip. This will be your starting position. Initiate the movement by flexing at the elbow, attempting to keep the upper arm stationary. Continue to the top of the movement and pause, then slowly return to the start position."
  }
]